#include <iostream>

using std::cin;
using std::cout;
using std::endl;

/**
    По въведени n (нечетно) на брой числа, всяко от които се среща по два пъти с изключение на едно,
    коeто е уникално. Намерете това число. При решаване на задачата не е позволено използването на масиви.
    Входът за програмата ви ще изглежда по следния начин:
    На първия ред едно число n - броя числа
    На втория ред n на брой цели положителни числа.

    При реализацията на програмата допускаме че потребителят винаги ще въвежда коректни входни данни.

    Пример:
    Вход:
    5
    1 2 3 2 1
    Изход:
    3

    Този начин работи на следния принцип:

    ^ - exclusive or
    (Едното или другото, но не и едновременно)
    0^1 = 1, 1^0 = 1, 0^0 = 0, 1^1 = 0

 	7  = 0111
    13 = 1101


    	1101
      ^ 1101
      = 0000 -> 0

    	1101 -> 13
    	0111 -> 7
      ^ 1101 -> 13
      = 0111 -> 7


	  a ^ b ^ c ^ a ^ b     # Commutativity 						<br>
	= a ^ a ^ b ^ b ^ c     # Using x ^ x = 0						<br>
	= 0 ^ 0 ^ c             # Using x ^ 0 = x (and commutativity) 	<br>
	= c

 	=> abcab -> c
*/

int main() {
	unsigned long n, p, result = 0;
	cin >> n;

	for (int i = 0; i < n; i++) {
		cin >> p;
		result = result ^ p;
	}

	cout << result;

	return 0;
}